tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# build tools
brew "autoconf"
brew "automake"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "libtool"

# basic
brew "tmux"
brew "hstr"
brew "wget"

# network monitor
brew "bmon"
brew "iftop"
brew "wireshark"

# ping
brew "fping"
brew "gping"
brew "prettyping"

# network misc
brew "mtr" # ping + traceroute
    # need ln -sf $(brew --prefix mtr)/sbin/mtr /usr/local/bin &&  ln -sf $(brew --prefix mtr)/sbin/mtr-packet /usr/local/bin
brew "dog" # like dig
brew "iproute2mac"
brew "telnet"

# process monitor
brew "htop"      # graphical top
brew "zenith"    # graphical top
brew "procs"     # alt ps

# task queue
brew "parallel"  # taskq queue
brew "pueue"

# misc
brew "gibo"
brew "nkf"
brew "nnn"
brew "sox"
brew "bingrep"
    # need ln -sf $(brew --prefix bingrep)/bin/bingrep /usr/local/bin

cask "alfred"
cask "chrome-remote-desktop-host"
cask "coderunner"
cask "fork"
cask "google-chrome"
cask "hex-fiend"
cask "iterm2"
cask "sublime-text"
cask "visual-studio-code"
cask "zerotier-one"
